src/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей/НастройкиПодключенияКСистемеБыстрыхПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПодключенияКСистемеБыстрыхПлатежей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИдентификаторМерчанта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>140</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПлатежнаяСистема</name>
    <type>
      <types>EnumRef.УдалитьПлатежныеСистемы</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/НастройкиУчастниковСБП/НастройкиУчастниковСБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчастниковСБП</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>140</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовыеСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлатежныйАгрегатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СверкаВзаиморасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипАутентификации</name>
    <type>
      <types>EnumRef.ТипыАутентификацииСБП</types>
    </type>
  </resources>
  <resources>
    <name>ПодключениеКассовойСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапрещенВыборУчастника</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/НастройкиПодключенияКСистемеБыстрыхПлатежей/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Результат = ОбновлениеИнформационнойБазы.ОбъектОбработан(
		"Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей");
	
	Если Не Результат.Обработан Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.НоваяИнтеграция.Доступность = Ложь;
		Элементы.Список.Доступность = Ложь;
		Элементы.ФормаДобавитьИнтеграциюСБП.Доступность = Ложь;
		ОбщегоНазначения.СообщитьПользователю(
			Результат.ТекстИсключения);
	КонецЕсли;
	
	ЭтотОбъект.КоманднаяПанель.Видимость = СистемаБыстрыхПлатежей.НастройкаПодключенияДоступна();
	Элементы.СписокКонтекстноеМенюСкопировать.Видимость = ЭтотОбъект.КоманднаяПанель.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(
		Элемент,
		Отказ,
		Копирование,
		Родитель,
		Группа,
		Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(
		Элемент,
		ВыбраннаяСтрока,
		Поле,
		СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Родитель)
		И Не Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		ОбработатьВыборНастройки(
			ВыбраннаяСтрока,
			Элемент.ТекущиеДанные.ИдентификаторУчастника)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбновитьДанныеФормы",
		ЭтотОбъект);
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("БИК", Неопределено);
	ПараметрыПодключения.Вставить("НастройкаПодключения", Неопределено);
	ПараметрыПодключения.Вставить("ДополнительныеПараметры", Неопределено);
	
	СистемаБыстрыхПлатежейКлиент.СлужебнаяПодключитьСистемуБыстрыхПлатежей(
		ПараметрыПодключения,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	
	ТекстПредупреждения = НСтр("ru = 'Копирование доступно только для настроек подключения.'");
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(
			Неопределено,
			ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьПредупреждение(
			Неопределено,
			ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбновитьДанныеФормы",
		ЭтотОбъект);
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("БИК", Неопределено);
	ПараметрыПодключения.Вставить("НастройкаПодключения", Элементы.Список.ТекущиеДанные.Ссылка);
	ПараметрыПодключения.Вставить("ДополнительныеПараметры", Неопределено);
	
	СистемаБыстрыхПлатежейКлиент.СлужебнаяПодключитьСистемуБыстрыхПлатежей(
		ПараметрыПодключения,
		ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ОформлениеОтбор = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОформлениеОтбор = ОформлениеОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОформлениеОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОформлениеОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОформлениеОтбор.ПравоеЗначение = Истина;
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветТекста",
		Метаданные.ЭлементыСтиля.ЦветНеАктивнойСтроки.Значение);
	
	ОформлениеОтбор = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОформлениеОтбор = ОформлениеОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОформлениеОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Используется");
	ОформлениеОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОформлениеОтбор.ПравоеЗначение = Ложь;
	
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"ЦветТекста",
		Метаданные.ЭлементыСтиля.ЦветИнформацияОшибочна.Значение);
	
	ОформлениеОтбор = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ОформлениеОтбор = ОформлениеОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОформлениеОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИдентификаторУчастника");
	ОформлениеОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОформлениеОтбор.ПравоеЗначение = СистемаБыстрыхПлатежейКлиентСервер.ИдентификаторНеизвестногоУчастника();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборНастройки(
		НастройкаПодключения,
		ИдентификаторУчастника)
	
	Если ИдентификаторУчастника = СистемаБыстрыхПлатежейКлиентСервер.ИдентификаторНеизвестногоУчастника() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("НастройкаПодключения", НастройкаПодключения);
		ДополнительныеПараметры.Вставить("ИдентификаторУчастника", ИдентификаторУчастника);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПриОтветеНаВопросВыбораУчастника",
			ЭтотОбъект,
			ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(
			"Выбрать",
			НСтр("ru = 'Выбрать'"));
		Кнопки.Добавить(
			"Отмена",
			НСтр("ru = 'Отмена'"));
		
		ПоказатьВопрос(
			ОписаниеОповещения,
			НСтр("ru = 'Идентификатор настройки не определен, для продолжения необходимо выбрать участника СБП.'"),
			Кнопки);
			
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", НастройкаПодключения);
		ОткрытьФорму(
			"Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей.ФормаОбъекта",
			ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросВыбораУчастника(
		Ответ,
		ДополнительныеПараметры) Экспорт
	
	Если Ответ = "Выбрать" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеВыбораУчастникаСБП",
			ЭтотОбъект,
			ДополнительныеПараметры);
		ОткрытьФорму(
			"РегистрСведений.НастройкиУчастниковСБП.Форма.ВыборУчастникаСБП",
			Неопределено,
			ЭтотОбъект,
			ЭтотОбъект.УникальныйИдентификатор,
			,
			,
			ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораУчастникаСБП(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбновитьИдентификаторУчастника(
			ДополнительныеПараметры.НастройкаПодключения,
			Результат);
		Элементы.Список.Обновить();
		ОбработатьВыборНастройки(
			ДополнительныеПараметры.НастройкаПодключения,
			Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИдентификаторУчастника(
		НастройкаПодключения,
		ИдентификаторУчастника)
	
	Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей.ОбновитьИдентификаторУчастника(
		НастройкаПодключения,
		ИдентификаторУчастника);
	
КонецПроцедуры

#КонецОбласти
